Revit 2027 API
TextTreatment Enumeration
 An enumerated type listing possible text treatment modes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TextTreatment
Public Enumeration TextTreatment
public enum class TextTreatment
type TextTreatment
Members
Member name | Value | Description
Approximate | 1 |  Export texts as approximate visual fidelity. Formatting intelligence will be maintained.
Exact | 0 |  Export texts as exact visual fidelity. Formatting intelligence will be lost.
See Also
Reference
Autodesk.Revit.DB Namespace